In [16]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [17]:
df = sns.load_dataset('titanic')

In [18]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [19]:
edf = df.drop(['deck','embark_town'],axis=1)
edf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 13 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   survived    891 non-null    int64
 1   pclass      891 non-null    int64
 2   sex         891 non-null    object
 3   age         714 non-null    float64
 4   sibsp       891 non-null    int64
 5   parch       891 non-null    int64
 6   fare        891 non-null    float64
 7   embarked    889 non-null    object
 8   class       891 non-null    category
 9   who         891 non-null    object
 10  adult_male  891 non-null    bool
 11  alive       891 non-null    object
 12  alone       891 non-null    bool
dtypes: bool(2), category(1), float64(2), int64(4), object(4)
memory usage: 72.4+ KB

In [20]:
edf = edf.dropna(subset=['age'],axis=0)
edf.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 714 entries, 0 to 890
Data columns (total 13 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   survived    714 non-null    int64
 1   pclass      714 non-null    int64
 2   sex         714 non-null    object
 3   age         714 non-null    float64
 4   sibsp       714 non-null    int64
 5   parch       714 non-null    int64
 6   fare        714 non-null    float64
 7   embarked    712 non-null    object
 8   class       714 non-null    category
 9   who         714 non-null    object
 10  adult_male  714 non-null    bool
 11  alive       714 non-null    object
 12  alone       714 non-null    bool
dtypes: bool(2), category(1), float64(2), int64(4), object(4)
memory usage: 63.6+ KB

In [21]:
most_embarked = df['embarked'].value_counts().idxmax()
edf['embarked'].fillna(most_embarked,inplace=True)
edf.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 714 entries, 0 to 890
Data columns (total 13 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   survived    714 non-null    int64
 1   pclass      714 non-null    int64
 2   sex         714 non-null    object
 3   age         714 non-null    float64
 4   sibsp       714 non-null    int64
 5   parch       714 non-null    int64
 6   fare        714 non-null    float64
 7   embarked    714 non-null    object
 8   class       714 non-null    category
 9   who         714 non-null    object
 10  adult_male  714 non-null    bool
 11  alive       714 non-null    object
 12  alone       714 non-null    bool
dtypes: bool(2), category(1), float64(2), int64(4), object(4)
memory usage: 63.6+ KB

In [22]:
edf = edf[['survived','pclass','sex','age','sibsp','parch','embarked']]
edf.head()

   survived  pclass     sex   age  sibsp  parch embarked
0         0       3    male  22.0      1      0        S
1         1       1  female  38.0      1      0        C
2         1       3  female  26.0      0      0        S
3         1       1  female  35.0      1      0        S
4         0       3    male  35.0      0      0        S

In [23]:
onehot_sex = pd.get_dummies(edf['sex'])
onehot_embarked = pd.get_dummies(edf['embarked'])
edf = pd.concat([edf,onehot_sex,onehot_embarked],axis=1)
edf.drop(['sex','embarked'],axis=1,inplace=True)
edf.head()

   survived  pclass   age  sibsp  parch  female  male  C  Q  S
0         0       3  22.0      1      0       0     1  0  0  1
1         1       1  38.0      1      0       1     0  1  0  0
2         1       3  26.0      0      0       1     0  0  0  1
3         1       1  35.0      1      0       1     0  0  0  1
4         0       3  35.0      0      0       0     1  0  0  1

### 데이터셋 구분 (train, test))

In [26]:
x = edf[['pclass','age','sibsp','parch','female','male','C','Q','S']]
y = edf['survived']

In [31]:
from sklearn import preprocessing
x = preprocessing.StandardScaler().fit(x).transform(x)
print(x)

[[ 0.91123237 -0.53037664  0.52457013 ... -0.47180795 -0.20203051
   0.53307848]
 [-1.47636364  0.57183099  0.52457013 ...  2.11950647 -0.20203051
  -1.87589641]
 [ 0.91123237 -0.25482473 -0.55170307 ... -0.47180795 -0.20203051
   0.53307848]
 ...
 [-1.47636364 -0.73704057 -0.55170307 ... -0.47180795 -0.20203051
   0.53307848]
 [-1.47636364 -0.25482473 -0.55170307 ...  2.11950647 -0.20203051
  -1.87589641]
 [ 0.91123237  0.15850313 -0.55170307 ... -0.47180795  4.94974747
  -1.87589641]]

In [32]:
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test = train_test_split(x,y,test_size=0.3)
print(x_train.shape, x_test.shape)

(499, 9) (215, 9)

In [33]:
from sklearn.neighbors import KNeighborsClassifier
knn = KNeighborsClassifier(n_neighbors=6)
knn.fit(x_train, y_train) # 학습 실시

KNeighborsClassifier(n_neighbors=6)

In [35]:
y_hat = knn.predict(x_test)

In [36]:
print(y_hat)

[1 0 1 0 1 1 1 0 0 0 0 0 0 1 0 0 0 0 0 0 0 1 0 0 0 0 0 1 0 0 0 1 0 0 1 0 1
 0 0 0 0 1 0 0 0 0 0 0 0 1 0 0 0 0 0 0 0 1 0 0 1 1 0 1 1 1 0 0 1 1 1 0 0 0
 0 0 0 0 1 0 1 1 1 0 0 1 0 1 0 0 1 0 0 0 0 1 0 0 0 0 0 0 1 0 1 0 1 1 1 0 0
 0 0 0 0 1 0 1 1 0 1 0 0 0 0 1 0 0 0 0 1 1 0 1 0 1 0 0 1 1 1 1 0 1 0 1 0 1
 0 1 1 0 1 0 0 1 0 0 1 0 0 1 0 1 0 0 0 1 0 0 0 1 0 1 0 1 1 0 0 0 0 0 0 0 0
 0 0 0 1 0 0 0 0 0 1 0 0 0 0 1 0 1 0 0 0 0 1 1 0 1 1 1 0 0 1]

In [38]:
from sklearn import metrics
knn_matrix = metrics.confusion_matrix(y_test,y_hat)
print(knn_matrix)

[[108  14]
 [ 34  59]]

In [39]:
knn_report = metrics.classification_report(y_test,y_hat)

In [40]:
print(knn_report)

              precision    recall  f1-score   support

           0       0.76      0.89      0.82       122
           1       0.81      0.63      0.71        93

    accuracy                           0.78       215
   macro avg       0.78      0.76      0.76       215
weighted avg       0.78      0.78      0.77       215